
* Familiar: A Study In Data Analysis
Welcome to Familiar, a startup in the new market of blood transfusion! You've joined the team because you appreciate the flexible hours and extremely intelligent team, but the overager doorman welcoming you into the office is a nice way to start your workday (well, work-evening).

Familiar has fallen into some touhg times lately, so you're hoping to help them make some insights about their product and help to move the needle (so to speak).

* What can Familiar Do For You?
** Task 1
The Familiar team has provided us with some data on lifespans for subscribers to two different packages, The Vein Pack and the Artery Pack! This data has been loaded for you a a dataframe named lifespans. Use the .head() method to print out the first five rows and take a look!

** Task 2
The first thing we want to know is whether Familiar's most basic package, the Vein Pack, actually has a significant impact on the subscribers. It would be a marketing goldmine if we can show that subscribers to the Vein Pack live longer than other people.

Extract the life spans of subscribers to the 'vein' pack and save the data into a variable called vein_pack_lifespans.

** Task 3
Next, use np.mean() to calculate the average lifespan for Vein Pack subscribers and print the result. Is it longer than 73 years?

** Task 4
We'd like to find out if the average lifespan of a Vein Pack subscriber is significantly different from the average life expentancy of  73 years.

Import the statistical test from scipy.stats that we would use to test the following null and alternative hypotheses:

    - Null: The average lifespan of  a Vein Pack subscriber is 73 years.
    - Alternative: The average lifespan of a Vein Pack subscriber is NOT 73 years.

** Task 5
Now that you’ve imported the function you need, run the significance test and print out the p-value! Is the average lifespan of a Vein Pack subscriber significantly longer than 73 years? Use a significance threshold of 0.05.

We conclude that the average lifespan of Vein Pack subscribers IS significantly different from 73 years.

* Script.py

#+begin_src python :results output

import pandas as pd
import numpy as np

# Load datasets
lifespans = pd.read_csv("familiar_lifespan.csv")
print(lifespans.head())

# Save lifespans for vein pack subscribers
vein_pack_lifespans = lifespans.lifespan[lifespans.pack=='vein']

# Calculate average lifespans for vein pack
print(np.mean(vein_pack_lifespans))

# Run one-sample t-test
from scipy.stats import ttest_1samp
tstat, pval = ttest_1samp(vein_pack_lifespans, 73)
print(pval)


#+end_src

#+RESULTS:
:      pack   lifespan
: 0    vein  76.255090
: 1  artery  76.404504
: 2  artery  75.952442
: 3  artery  76.923082
: 4  artery  73.771212
: 76.16901335636044
: 5.972157921433211e-07
